docs: Revise architecture and backend flow diagrams
Updated architecture and backend request flow diagrams in README.

Signed-off-by: Kashyap Tanuku <kashyaptan2004@gmail.com>
